particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
ssize_t BleGap::getAdvertisingData(uint8_t* buf, size_t len) const {
    if (!buf) {
        return advDataLen_;
    }
    len = std::min(len, advDataLen_);
    memcpy(buf, advData_, len);
    return len;
}

int BleGap::setScanResponseData(const uint8_t* buf, size_t len) {
    bool advertising = isAdvertising();
    SCOPE_GUARD ({
        if (advertising) {
            startAdvertising(true);
        }
    });
    CHECK(stopAdvertising(true));
    if (buf != nullptr) {
        len = std::min(len, (size_t)BLE_MAX_ADV_DATA_LEN);
        memcpy(scanRespData_, buf, len);
    } else {
        len = 0;
    }
    scanRespDataLen_ = len;
    CHECK_RTL(le_adv_set_param(GAP_PARAM_SCAN_RSP_DATA, len, (void*)buf));
    return SYSTEM_ERROR_NONE;
}

ssize_t BleGap::getScanResponseData(uint8_t* buf, size_t len) const {
    if (!buf) {
        return scanRespDataLen_;
    }
    len = std::min(len, scanRespDataLen_);
    memcpy(buf, scanRespData_, len);
    return len;
}

int BleGap::startAdvertising(bool wait) const {
    // The attribute table needs to be registered before BT stack starts.
    // Now we assume that the attribute table is finalized.
    // Register it to BT stack
    BleGatt::getInstance().registerAttributeTable();
    // Starts the BT stack
    CHECK(BleGap::getInstance().start());

    SCOPE_GUARD ({
        if (!isAdvertising() && os_timer_is_active(advTimeoutTimer_, nullptr)) {
            os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_STOP, hal_interrupt_is_isr() ? true : false, 0, 0, nullptr);
        }
    });
    if (state_.gap_adv_state != GAP_ADV_STATE_ADVERTISING && state_.gap_adv_state != GAP_ADV_STATE_START) {
        if (advParams_.timeout != 0) { // 0 for advertising infinitely
            if (os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_PERIOD, hal_interrupt_is_isr() ? true : false, advParams_.timeout * 10 + BLE_ADV_TIMEOUT_EXT_MS, 0, nullptr)) {
                LOG(ERROR, "Failed to start timer.");
                return SYSTEM_ERROR_INTERNAL;
            }
        }
        CHECK_RTL(le_adv_start());
    }
    if (wait) {
        LOG_DEBUG(TRACE, "Starting advertising...");
        while (state_.gap_adv_state != GAP_ADV_STATE_ADVERTISING) {
            HAL_Delay_Milliseconds(10);
        }
    }
    LOG_DEBUG(TRACE, "Advertising started");
    return SYSTEM_ERROR_NONE;
}

int BleGap::stopAdvertising(bool wait) const {
    if (state_.gap_adv_state != GAP_ADV_STATE_ADVERTISING && state_.gap_adv_state != GAP_ADV_STATE_START) {
        return SYSTEM_ERROR_NONE;
    }
    CHECK_RTL(le_adv_stop());
    if (os_timer_is_active(advTimeoutTimer_, nullptr)) {
        os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_STOP, hal_interrupt_is_isr() ? true : false, 0, 0, nullptr);
    }
    if (wait) {
        LOG_DEBUG(TRACE, "Stopping advertising...");
        while (state_.gap_adv_state != GAP_ADV_STATE_IDLE) {
            HAL_Delay_Milliseconds(10);
        }
    }
    LOG_DEBUG(TRACE, "Advertising stopped");
    return SYSTEM_ERROR_NONE;
}

void BleGap::onAdvTimeoutTimerExpired(os_timer_t timer) {
    BleGap* gap;
    os_timer_get_id(timer, (void**)&gap);
    if (gap->isAdvertising()) {
        gap->stopAdvertising(true);
    }
}

bool BleGap::scanning() {
    return isScanning_;
}

int BleGap::setScanParams(const hal_ble_scan_params_t* params) {
    CHECK_TRUE(params, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->interval >= BLE_SCAN_INTERVAL_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->interval <= BLE_SCAN_INTERVAL_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->window >= BLE_SCAN_WINDOW_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->window <= BLE_SCAN_WINDOW_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->window <= params->interval, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(&scanParams_, params, std::min(scanParams_.size, params->size));
    scanParams_.size = sizeof(hal_ble_scan_params_t);
    scanParams_.version = BLE_API_VERSION;
    uint8_t filterDuplicate = GAP_SCAN_FILTER_DUPLICATE_ENABLE;
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_MODE, sizeof(uint8_t), &scanParams_.active));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_INTERVAL, sizeof(uint16_t), &scanParams_.interval));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_WINDOW, sizeof(uint16_t), &scanParams_.window));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_FILTER_POLICY, sizeof(uint8_t), &scanParams_.filter_policy));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_FILTER_DUPLICATES, sizeof(uint8_t), &filterDuplicate));
    return SYSTEM_ERROR_NONE;
}

int BleGap::getScanParams(hal_ble_scan_params_t* params) const {
    CHECK_TRUE(params, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(params, &scanParams_, std::min(scanParams_.size, params->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::startScanning(hal_ble_on_scan_result_cb_t callback, void* context) {
    CHECK_FALSE(isScanning_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        if (isScanning_) {
            const int LE_SCAN_STOP_RETRIES = 10;
            for (int i = 0; i < LE_SCAN_STOP_RETRIES; i++) {
                // This has seen failing a number of times at least
                // with btgap logging enabled. Retry a few times just in case,
                // otherwise the next scan operation fails with invalid state.
                auto r = le_scan_stop();
                if (r == GAP_CAUSE_SUCCESS) {
                    isScanning_ = false;
                    break;
                }
                HAL_Delay_Milliseconds(10);
            }
            SPARK_ASSERT(!isScanning_);
            clearPendingResult();
        }
    });
    // Starts the BT stack
    CHECK(BleGap::getInstance().start());
    scanResultCallback_ = callback;
    context_ = context;
    CHECK_RTL(le_scan_start());
    isScanning_ = true;
    // To be consistent with Gen3, the scan proceedure is blocked for now,
    // so we can simply wait for the semaphore to be given without introducing a dedicated timer.
    os_semaphore_take(scanSemaphore_, (scanParams_.timeout == BLE_SCAN_TIMEOUT_UNLIMITED) ? CONCURRENT_WAIT_FOREVER : (scanParams_.timeout * 10), false);
    return SYSTEM_ERROR_NONE;
}

int BleGap::stopScanning() {
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }
    os_semaphore_give(scanSemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

